{
  "intents": [
      {
          "tag": "greeting",
          "patterns": [
              "Hi",
              "Hey",
              "How are you",
              "How are you doing",
              "Is anyone there?",
              "What's up?",
              "Hello",
              "Good day",
              "What's popping"
          ],
          "responses": [
              "Hey! Welcome to Aurora. My friends call me Aura.",
              "Hi there, I'm doing well! My name's Aurora, what can I do for you?",
              "Hey there, my name's Aurora, your friendly neighbourhood chatbot. How can I help you today?",
              "Hi homie! Aurora's back.",
              "What's popping on your side?",
              "Roses are red, violets are blue. I'm Aurora, who are you?"
          ]
      },
      {
          "tag": "goodbye",
          "patterns": ["Bye", "See you later!", "Goodbye!", "Thank you"],
          "responses": [
              "See you later! Take care!",
              "Have a lovely day! Take care and stay safe!",
              "Take care of yourself! I'm always here to support you! Feel free to come back at any time!",
              "See you later, alligator.",
              "Sad to see you go. Feel free to text me anytime. LITERALLY."
          ]
      },
      {
          "tag": "thanks",
          "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
          "responses": [
            "Happy to help!",
            "Any time!",
            "My pleasure",
            "Always at your service."
        ]
      },
      {
          "tag": "about",
          "patterns": [
              "What do you do?",
              "Who are you?",
              "What are you here for?",
              "What can you help me with?",
              "Is anyone there?",
              "Are you a real person?",
              "Tell me about yourself!"
          ],
          "responses": [
            "That's actually something I get asked a lot. I am an AI powered chatbot, and I was created for the purpose of mental health awareness. You can find me inside ANAVRIN, which has features like task management and journalling. I am your friend who's gonna reply to you!",
            "Heh, Love that question, I am a chatbot made to mirror the way humans talk. You can use me as a friend, as a mental health awareness assistant, or your personal movie and song recommendor!. Don't worry, I promise I will always reply.",
            "Thank you for asking me, I am chatbot, and I am here to help you with any queries related to mental health awareness. Apart from that, you can ask for anything and I would try my best to answer it. I am that friend who will always reply."
          ]
      },
      {
          "tag": "anxiety",
          "patterns": [
              "I think I have anxiety",
              "What is anxiety?",
              "Tell me about anxiety",
              "Can I have some information about anxiety?",
              "How do I support a loved one with anxiety?",
              "How do I fix my anxiety?"
          ],
          "responses": [
              "I see that you want to learn more about anxiety, and how to support yourself or your loved ones. At the higest level, anxiety is your body's natural response to stress. It's a feeling of fear or apprehension about what's to come. The first day of school, going to a job interview, or giving a speech may cause most people to feel fearful and nervous. We all get anxious sometimes, but anxiety becomes a problem when it starts affecting your daily life drastically. The best thing that you can do to help reduce anxiety is to take a few deep breaths and talk to someone about what you're feeling. Some natural remedies that you can try include: getting enough sleep meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes. Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid.",
              "Anxiety is what we feel when we are worried, tense or afraid – particularly about things that are about to happen, or which we think could happen in the future. Anxiety is a natural human response when we feel that we are under threat. It can be experienced through our thoughts, feelings and physical sensations. Difficult experiences in childhood, adolescence or adulthood are common triggers for anxiety problems. Going through stress and trauma when you're very young is likely to have a particularly big impact. Living with anxiety can be very difficult, but there are steps you can take that might help. Start cutting out on caffeine, try to talk to someone who gets it, have a bath, turn off your phone, dance it out, or write it out. I know these might sound a little too simple, but trying always helps, and if nothing works out, seek out medical help."
          ]
      },
      {
          "tag": "depression",
          "patterns": [
              "I think I have depression",
              "What is depression?",
              "Tell me about depression",
              "Can I have some information about depression?",
              "How do I support a loved one with depression?",
              "How do I fix my depression?"
          ],
          "responses": [
              "I see that you want to learn more about depression, and how to support yourself or your loved ones. At the higest level, depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems. You may have trouble doing normal day-to-day activities, and sometimes you may feel as if life isn't worth living. All of us experience sadness and periods of time where things aren't that great. However, the difference in sadness and depression lies in the duration and magnitude of the problem. The best recommended course of treatment is to talk a therapist or psychiatrist who can help you find the best path for you. Everyone is different and what might work for one person might not work for another one. Some natural remedies that you can try include: getting enough sleep, meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes. Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid.",
              "Depression is a common mental disorder. It is characterized by persistent sadness and a lack of interest or pleasure in previously rewarding or enjoyable activities. It can also disturb sleep and appetite. Tiredness and poor concentration are common. The effects of depression can be long-lasting or recurrent and can dramatically affect a person’s ability to function and live a rewarding life. The causes of depression include complex interactions between social, psychological and biological factors. Life events such as childhood adversity, loss and unemployment contribute to and may catalyse the development of depression.",
              "There are a number of things people can do to help reduce the symptoms of depression. For many people, regular exercise helps create positive feeling and improves mood. Getting enough quality sleep on a regular basis, eating a healthy diet and avoiding alcohol (a depressant) can also help reduce symptoms of depression. Depression is a real illness and help is available. With proper diagnosis and treatment, the vast majority of people with depression will overcome it. If you are experiencing symptoms of depression, a first step is to see your family physician or psychiatrist. Talk about your concerns and request a thorough evaluation. This is a start to addressing your mental health needs."
          ]
      },
      {
          "tag": "autism",
          "patterns": [
            "I think I have autism",
            "What is autism?",
            "Tell me about autism",
            "Can I have some information about autism?",
            "How do I support a loved one with autism?",
            "How do I fix my autism?"
          ],
          "responses": [
            "Autism is a neurodevelopmental condition which is usually diagnosed in the first 3 years of life. Generally parents become concerned when their child has delays in speech development, limited social relatedness, and restricted interests and activities. The child may avoid direct eye contact and exhibit odd behaviors such as focusing on parts of objects (e.g. the spinning wheel of a toy car). There may be unusual motor movements such as hand flapping, self stimulation or walking on toes. Although the cause of autism is unknown, it is generally believed that etiology may be due to multiple factors. Many genetic, environmental, metabolic and neurological conditions that affect the normal functioning of the brain are being researched. The diagnosis of autism requires disturbances in each of three domains: (1) social relatedness, (2) communication/play, and (3) restricted interests and activities.",
            "An autistic person may find it hard to understand the emotions of other people.Emotions are interpreted by subtle messages sent by facial expression, eye contact and body language. These are often missed or misinterpreted by an autistic person. Because of this, autistic people might be mistakenly perceived as being rude or unfeeling. Autistic people may find it difficult to understand how others perceive their behaviour.",
            "Autism spectrum disorder impacts the nervous system and affects the overall cognitive, emotional, social and physical health of the affected individual. The range and severity of symptoms can vary widely. Common symptoms include difficulty with communication, difficulty with social interactions, obsessive interests and repetitive behaviours. Early recognition, as well as behavioural, educational and family therapies may reduce symptoms and support development and learning.",
            "Autism can be a challenging condition, especially when you, as a caregiver, are not equipped with the right information to take care of a person who has the disorder. In adults, the symptoms of autism are a little more recognizable. Here are some tips you should know to help care for someone with autism: Be Patient, learn how to communicate with them, and ask for help. And if you yourself are struggling, please be kind to yourself and practice self care, along with asking for help."
          ]
      },
      {
          "tag": "funny",
          "patterns": [
              "Tell me a joke!",
              "Tell me something funny!",
              "Do you know a joke?",
              "Can you joke?"
          ],
          "responses": [
              "I invented a new word! Plagiarism!",
              "What's the best thing about Switzerland?  I don't know but the flag is a big plus.",
              "Yesterday I saw a guy spill all his Scrabble letters on the road. I asked him, “What's the word on the street?”",
              "Don't you hate it when someone answers their own questions? I do.",
              "Never trust atoms; they make up everything.",
              "Before you criticize someone, walk a mile in their shoes. That way, when you do criticize them, you're a mile away and you have their shoes.",
              "Last night my girlfriend was complaining that I never listen to her… or something like that.",
              "People who take care of chickens are literally chicken tenders.",
              "Why did the mushroom go to the party? Because he was a FUN-GI!",
              "How do you make holy water? You boil the hell out of it. Heh."
          ]
      },
      {
        "tag": "ocd",
        "patterns": [
          "I think I have OCD",
          "What is OCD?",
          "Tell me about OCD",
          "Can I have some information about OCD?",
          "How do I support a loved one with OCD?",
          "How do I fix my OCD?"
        ],
        "responses": [
          "Obsessive-compulsive disorder (OCD) features a pattern of unwanted thoughts and fears (obsessions) that lead you to do repetitive behaviors (compulsions). These obsessions and compulsions interfere with daily activities and cause significant distress.",
          "Obsessive-compulsive disorder is characterised by unreasonable thoughts and fears (obsessions) that lead to compulsive behaviours. OCD often centres on themes such as a fear of germs or the need to arrange objects in a specific manner. Symptoms usually begin gradually and vary throughout life. There's a difference between being a perfectionist — someone who requires flawless results or performance, for example — and having OCD. OCD thoughts aren't simply excessive worries about real problems in your life or liking to have things clean or arranged in a specific way. If your obsessions and compulsions are affecting your quality of life, see your doctor or mental health professional."
        ]
      },
      {
        "tag": "adhd",
        "patterns": [
          "I think I have ADHD",
          "What is ADHD?",
          "Tell me about ADHD",
          "Can I have some information about ADHD?",
          "How do I support a loved one with ADHD?",
          "How do I fix my ADHD?"
        ],
        "responses": [
          "ADHD is a condition of the brain that makes it difficult for children to control their behavior. It is one of the most common chronic conditions of childhood. It affects 4% to 12% of school-aged children. About 3 times more boys than girls are diagnosed with ADHD. ADHD includes 3 behavior symptoms: inattention, hyperactivity, and impulsivity. It is believed that people with ADHD lack the right balance of neurotransmitters, which are specific chemicals in their brains, that help them to focus and inhibit impulses. Unfortunately, there is no single test that can tell whether your child has ADHD. The diagnosis process requires several steps and involves gathering a lot of information from multiple sources. There is no specific cure for ADHD, but there are many treatment options available. Each child's treatment must be tailored to meet individual needs."
        ]
      },
      {
        "tag": "overthinking",
        "patterns": [
            "There's just so much going on",
            "I can't focus on one thing",
            "A lot going on",
            "My mind keeps thinking and thinking and thinking and I don't know how to stop it."
        ],
        "responses": [
          "Hey. I know this seems stupid and annoying but please just take a few minutes and just breathe. Breathe out the tension. I know it seems like a really big thing but it's not. Sometimes, problems aren't as big as we think they are. Just zoom out a bit and see it from a different perspective.",
          "I understand there's a lot going on. I totally do. But thinking about all of it at once is overwhelming. So I request you, please just try to focus on one thing at a time. Divide it into parts and it'll get easier. Focus on one small part at a time."
        ]
      },
      {
        "tag": "sad",
        "patterns": [
            "Feeling low",
            "Feeling down",
            "I feel sad",
            "I'm not happy",
            "I don't feel good",
            "Literally feel like crying."
        ],
        "responses": [
            "Would you like me to suggest you some movies?",
            "Would you like me to suggest you some comforting TV series?",
            "Would you like to listen to some music?",
            "When you find yourself doubting how far you can go, just remember how far you have come. Remember everything you have faced, all the battles you have won, and all the fears you have overcome.",
            "Hey. It's okay. Stop beating yourself up. You are a work in progress, which means you get there a little at a time, not all at once.",
            "We all go through sad moments, but the good thing is that they pass, do not worry that you are not alone in this, you have my support for everything you need."
        ]
      },
      {
        "tag": "unproductive",
        "patterns": [
            "I feel like I'm not doing anything",
            "I can't complete my tasks",
            "I am not doing anything",
            "I feel like a loser, I cant do anything"
        ],
        "responses": [
            "We can't be productive all the time. It's okay to not be doing something at every single moment.",
            "It's okay to feel stuck sometimes. Everybody gets stuck every once in a while. It's okay.",
            "Is there something you think you can do in the current situation? If yes, then focus on it first."
        ]
      },
      {
        "tag": "motivation",
        "patterns": [
            "Can you tell me something to motivate me",
            "I lack motivation",
            "I feel a little low, some motivation might help.",
            "Just having a rough day"
        ],
        "responses": [
          "You can do it. Whatever it is that is bothering you, you are just so much more amazing to be stopped by this. Keep going",
          "Hey. You're amazing. You don't have to be afraid of anything. Just go for it and it'll all be good before you know it."
        ]
      },
      {
        "tag": "insecurity",
        "patterns": [
          "I dont think I'm good enough",
          "I dont know, I just can't stop comparing myself to literally everyone.",
          "Everything makes me feel bad about myself"
        ],
        "responses": [
          "Hey. You're a great person, you know. You even thinking about this is proof that you are a good person because bad people, they don't think like that. In your heart, you want to be a good person and that's what matter. And I'm proud of you, keep that in mind.",
          "Sweetheart, you're an amazing and fabulous person. And maybe you're not as everyone else wants to be. But guess what? That makes you the amazing person you are. Because there is nobody else like you. And weird as it makes you, it is also your strength. Don't let anyone else make you feel bad for being awesome.",
          "I know that you are capable of many great things, today might be a little sad but it's the first day of the rest of your life, don't give up!"
        ]
      },
      {
        "tag": "reassurance",
        "patterns": [
          "I need some assurance",
          "What if it doesn't happen"
        ],
        "responses": [
          "Hey, it's going to be okay. It will be okay. I know its hard but the fact that you're present in this moment even though worrying about it, means that you are much stronger than what bothers you and I'm proud of you.",
          "It's alright. It's going to be alright. You're a great person and I'm proud of you.",
          "You're an awesome human being, and although humans are not perfect, I'm glad I got to know you."
        ]
      },
      {
        "tag": "movie",
        "patterns": [
            "Can you suggest me a movie",
            "Suggest me something to watch"
        ],
        "responses": [
            "Me Before You",
            "Liberal Arts",
            "The Kings of Summer",
            "Begin Again",
            "Five Feet Apart",
            "Before We Go",
            "Hacksaw Ridge",
            "The Edge of Seveteen",
            "My Best Friend's Wedding",
            "The Adam Project",
            "Dead Poets Society",
            "Notting Hill",
            "The Perks of Being a Wallflower",
            "The Half of it",
            "All the Bright Places",
            "Love, Rosie",
            "I dont suggest it to everyone, but start MCU if you haven't!",
            "10 things I hate about you.",
            "13 going on 30",
            "27 Dresses.",
            "50 first fates",
            "500 Days of Summer",
            "Bridget Jones's Diary",
            "Clueless",
            "The Godfather? THE GODFATHER!",
            "GoodFellas",
            "The Hangover",
            "The Wolf of Wall Street",
            "The 40-Year-Old Virgin",
            "Old School",
            "Wedding Crashers",
            "Deadpool, because everyone loves Ryan Reynolds"
        ]
      },
      {
        "tag": "series",
        "patterns": [
            "Can you suggest me a web series",
            "Can you suggest me a TV series",
            "Suggest me something to watch"
        ],
        "responses": [
            "2 Broke Girls, cause we all want to eat Max's Home-made Cupcakes.",
            "How I met your mother",
            "Friends, I KNOW",
            "Never Have I Ever, suggested Never Have I ever.",
            "The Good Doctor",
            "That 70s Show, we all could use some Jackie Burkhart energy.",
            "Keeping Up with the Kardashians, BIBLE.",
            "This is Us",
            "2 and a half men, cause... Why not?",
            "Uhm, ew david, but definitely watch Schitt's Creek"
        ]
      },
      {
        "tag": "music",
        "patterns": [
            "Can you suggest me something to listen to",
            "Suggest me some tunes",
            "What tunes shall I listen to"
        ],
        "responses": [
            "As it was by Harry Styles",
            "Folklore by Taylor Swift",
            "Dandelions by Ruth B.",
            "Weather any storms by Cody Francis",
            "Can't Hide by Whethan and Ashe",
            "Sleepy Eyes by Elohim and Whethan",
            "Sunday Best by Surfaces"
        ]
      },
      {
        "tag": "LGBTQ+ awareness",
        "patterns": [
          "How can I get others to be more open minded about LGBTQ people?",
          "How can I show support to the LGBTQ+ community?"
        ],
        "responses": [
          "Be aware that if you speak out about issues related to sexual orientation, some people may take this as an indication of your own sexual orientation. Take time in advance to think through how you might respond to this. How do you feel about your own sexual identity? Are you comfortable with yourself? Regardless of your sexual orientation, a confidence in your own self-image will make you less vulnerable.",
          "Share your beliefs with others when appropriate. When LGBTQ topics come up, talk about them, don't simply avoid them. Show that you are comfortable talking about these issues, and comfortable with LGBTQ people. Remember that part of your goal as an ally is to create bridges across differences and to increase understanding. While you may be motivated to share your views with others, be careful of being self-righteous; others can't learn from you if they are turned off from listening to begin with. Of course, your views are more convincing if they are supported by sound knowledge. Take the time to educate yourself so that you know what you are talking about."
        ]
      },
      {
        "tag": "LGBTQ+ questions",
        "patterns":[
          "I think I might be lesbian, gay, or bisexual. How do I know for sure?",
          "I have a crush on my same-sex best friend. Does this mean I'm LGB?"
        ],
        "responses": [
          "There are hundreds of different ways to realize you are not straight. If you think you're LGB, try not to hide your feelings from yourself. Yes, figuring out who you are can be stressful, emotional, and a little scary—you may not want to deal with it—but taking some time alone to think about how you feel is the first step toward accepting yourself. Give yourself permission to explore your thoughts, feelings, and emotions. Remember, everyone is unique and wonderful in their own way. ",
          "Think of sexuality as a range, or “sexual continuum.” At one end of the range are many people who are attracted only to the same sex. At the other end of the range are many people who are attracted only to the opposite sex. And in between are people who are attracted to both sexes in varying degrees. Again, remember that our sexuality develops over time. Don't worry if you aren't sure. Your early years are a time of learning, bit by bit, what works for you, and crushes and experimentation are often part of that process. Over time, you'll find that you're drawn mostly to men, women, or both—or neither!—and then you'll know. You don't have to label yourself."
        ]
      },
      {
        "tag": "body-insecurity",
        "patterns": [
          "I hate my body.",
          "I dont like my body.",
          "I feel ugly, and fat.",
          "I have stopped eating and I am still fat.",
          "I wish I had a better body."
        ],
        "responses": [
          "Ok first of all you're amazing. Let's just keep that as a baseline. No one looking at you is looking for faults, they're finding things to like. And it's okay if you don't feel good with your body from time to time. Society has based so much on appearance that we all have forgotten about the things that actually matter. You are precious, and so is your body. In fact, you HAVE a body, you're not A body. Dont limit yourself, because you are doing great, its gonna be fine. I promise.",
          "I can't understand how it must feel to you, but I can try to give you some thing to think of. Can you Journal this one question for me: Who's telling you your body isn't okay as it is, and why?",
          "It's important to realize that the purpose of having a body is not to be more attractive. Bodies do so much for us and allow us to live and function to the best of their ability. Does your body help you engage in your favorite hobbies? Eat good food? Let you laugh and talk to loved ones? Asking questions like these are important. And hey, It's okay to feel neutral about your body. And while it can be helpful to think about what your body can do, know that you have many other amazing qualities and that you deserve to be loved and accepted regardless of your abilities."
        ]
      }
  ]
}